tap "farion1231/ccswitch"
tap "nikitabobko/tap"
tap "tw93/tap"
tap "yqrashawn/goku"
brew "autossh"
brew "bash"
brew "bat"
brew "btop"
brew "freetype"
brew "curl"
brew "dua-cli"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "node"
brew "openjdk"
brew "pnpm"
brew "ripgrep"
brew "rustup"
brew "smartmontools"
brew "starship"
brew "tmux"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "tw93/tap/mole"
brew "yqrashawn/goku/goku"
cask "nikitabobko/tap/aerospace"
cask "antigravity"
cask "betterdisplay"
cask "blender"
cask "farion1231/ccswitch/cc-switch"
cask "cherry-studio"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "cursor"
cask "easydict"
cask "flowvision"
cask "font-fira-code-nerd-font"
cask "font-geist"
cask "font-geist-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-lxgw-wenkai"
cask "font-meslo-lg-nerd-font"
cask "font-sarasa-gothic"
cask "ghostty"
cask "google-chrome"
cask "handbrake-app"
cask "iina"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keka"
cask "localsend"
cask "markedit"
cask "miniforge"
cask "navicat-premium-lite"
cask "obsidian"
cask "orbstack"
cask "parsec"
cask "pearcleaner"
cask "raycast"
cask "sf-symbols"
cask "spotify"
cask "tailscale-app"
cask "trae-cn"
cask "unity-hub"
cask "upscayl"
cask "visual-studio-code"
cask "warp"
cask "wetype"
cask "zed"
mas "QQ", id: 451108668
mas "WPS Office", id: 1443749478
mas "Xcode", id: 497799835
mas "剪映专业版", id: 1529999940
mas "微信", id: 836500024
mas "百度网盘", id: 547166701
mas "网易云音乐", id: 944848654
mas "腾讯会议", id: 1484048379
mas "飞书", id: 1551632588
vscode "anthropic.claude-code"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
cargo "cargo-cache"
cargo "cargo-update"
